OpenFOAM/run/prescribedU/vortexShearedDisc/baseCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFlow;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         8;

writeControl    adjustableRunTime;

writeInterval   .1;

deltaT          1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           1e10;
maxAlphaCo      0.5;

maxDeltaT       .05;

libs ( "libVOFInterpolationSchemes.so" );

// ************************************************************************* //
